[
    {
        "id": 2938799373,
        "number": 5,
        "title": "Repositórios privados não podem ser minerados devido à limitação do PyDriller",
        "state": "open",
        "locked": false,
        "assignees": [],
        "labels": [],
        "milestone": null,
        "created_at": "2025-03-21T15:45:32Z",
        "updated_at": "2025-03-21T15:45:32Z",
        "closed_at": null,
        "author_association": "MEMBER",
        "body": "Atualmente, a API utiliza o PyDriller para extrair dados de commits dos repositórios GitHub. No entanto, o PyDriller precisa clonar o repositório localmente para realizar a mineração e não suporta autenticação via token para acessar repositórios privados.\n\nIsso significa que apenas repositórios públicos podem ser minerados, pois, para os privados, a tentativa de clonagem resulta em erro de permissão.\n\nPassos para reproduzir:\n\nFazer uma requisição POST para minerar commits de um repositório privado:\n\n{\n    \"repo_name\": \"meu-usuario/meu-repositorio-privado\",\n    \"start_date\": \"2023-01-01T00:00:00Z\",\n    \"end_date\": \"2023-12-31T00:00:00Z\"\n}\n\nA API retorna um erro informando que o repositório não pode ser acessado.\nO problema ocorre porque o PyDriller não consegue autenticar o clone do repositório.\n\nComportamento esperado:\n\n- Atualmente, a única solução é utilizar apenas repositórios públicos para a mineração de commits.\n- No futuro, pode ser interessante implementar uma solução alternativa que permita autenticação para repositórios privados.\n\nPossíveis soluções:\n\n- ✅ Explorar alternativas que permitam autenticação ao clonar repositórios privados com PyDriller.\n- ✅ Atualizar a documentação para informar que apenas repositórios públicos podem ser minerados.\n\nImpacto:\n🔹 Usuários tentando minerar commits de repositórios privados encontrarão erros inesperados.\n🔹 Pode limitar a utilidade da API para equipes que trabalham com código privado.",
        "reactions": {
            "url": "https://api.github.com/repos/aisepucrio/stnl-dataminer-api/issues/5/reactions",
            "total_count": 0,
            "+1": 0,
            "-1": 0,
            "laugh": 0,
            "hooray": 0,
            "confused": 0,
            "heart": 0,
            "rocket": 0,
            "eyes": 0
        },
        "is_pull_request": false,
        "timeline_events": [],
        "comments_data": [],
        "time_mined": 